---
kind: method
id: M:Autodesk.Revit.DB.PointRelativeToPoint.SetHostPointReference(Autodesk.Revit.DB.Reference)
source: html/68d232d3-f67f-4c19-79e6-e7ceed0407f2.htm
---
# Autodesk.Revit.DB.PointRelativeToPoint.SetHostPointReference Method

Change the host point reference.

## Syntax (C#)
```csharp
public void SetHostPointReference(
	Reference hostPointReference
)
```

## Parameters
- **hostPointReference** (`Autodesk.Revit.DB.Reference`)

## Remarks
Allowed references are to another Autodesk.Revit.DB.ReferencePoint element
or to an Autodesk.Revit.DB.Point.